[
  {
    "path": "posts/2021-06-18-dataviz-2/",
    "title": "DataViz 2",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Joyce WOON Shi Hui",
        "url": "https://www.linkedin.com/in/joycewoonsh/"
      }
    ],
    "date": "2021-06-18",
    "categories": [],
    "contents": "\r\n1.0 Critique of Visualisation\r\nThe original visualisation can be seen below as reference:\r\n\r\n1.1 Critique of Clarity\r\n1. Hidden details\r\nDue to the circles being opaque and bad placement of the labels, some details are unclear. The centre point of the bubble will help viewers distinguish between “Net Importers” and “Net Exporters” however, in some cases, this centre point is hidden. E.g. Taiwan’s centre point was covered by United States’ label while Malaysia, EU and Republic of Korea have their centre point covered by other circles. As such, it is unclear where the centre point falls.\r\n2. Not hidden but still unclear details\r\nFurthermore, Japan’s centre point falls between Exports and Imports. Unsure if Japan is a net exporter or importer.\r\n3. Lack of title and other explanatory text\r\nThere is no title to the graph, so viewers are unsure what this graph is supposed to be for.\r\nThere is also a lack of dates, thus viewers are unsure which period this graph is about. The tooltip talks about dates like 2009 and 2006 but we are unsure of how did this tooltip come about from the graph.\r\nFurthermore, there is no explanation on which markets the EU consists of, especially since Brexit, this might need to be clarified. There are also 2 entries from Republic of Korea in the data (one is Democratic), clarification about which was used should be written.\r\n1.2 Critique of Aesthetics\r\nColours\r\nWhile Net Importer and Net Exporter colours were good as they are both mild on the eyes and distinguishable from each other, there is just way too many colours on the graph which makes it hard to focus on the details. Furthermore, some colours were indistinguishable from each other, e.g. Thailand and EU have purple-blue tones and it is not easy to tell them apart. Japan is yellow and yellow font on white background is not a good idea. Further more, dotted yellow lines tend to become invisible. EU’s colour contrasts too strongly with Malaysia’s colour, this causes distress to the eyes and a reddish outline due to the visual illusion this causes (chromostereopsis).\r\nHidden Tooltips\r\nDue to the circles being opaque, some labels are partially hidden (e.g. Malaysia and Indonesia)\r\nUse of icons and ambiguous location of axis labels\r\nThere is not much of a point to add the icons to Exports and Imports since we can already tell from the text. Plus it confuses the viewers’ eyes since Exports is above Imports which could possibly confuse viewers at first glance, since net exporters are technically below net importers on the graph.\r\n2.0 Suggest Alternative Graphical Presentation\r\nThe plan is to create a dashboard with an interactive graph that allows switching the graph through the years by the use of a dropdown list. The goal is to clearly answer the following:\r\nWhich market had higher trade with Singapore during the period?\r\nWas the market a net importer or exporter with Singapore?\r\nWhat was the proportion of exports vs imports?\r\nAlso, a static table will be placed in the dashboard so that viewers who want answers on market rankings in terms of total trade volume across the years can get their answers as fast as possible without the interactive graph.\r\nThe graph and the table are meant to complement each other in the sense that the graph will give more details to the table.\r\n\r\nThe dashboard will have the following:\r\nOne interactive graph for Export, Import and Average for the markets across the periods\r\nOne static table for rankings of markets based on total trade volume with Singapore\r\nTo note, the tooltip for the interactive graph will contain the following information for the respective periods:\r\nTotal trade\r\nNet trade\r\nWhether the market is a net importer or exporter\r\nTotal exports\r\nTotal imports\r\nExport-import ratio\r\n2.1 Improvement to Clarity\r\nTitles and subtitles to explain graphs more clearly.\r\nTooltips show more relevant information. See previous section for said information.\r\nImports and Exports will be on the same axis to easily compare them.\r\nDates will clearly be shown.\r\nClarification on ambiguous markets like EU and Republic of Korea will be given.\r\nTooltips will only appear when hovering over specific portions of the interactive graph, which allows viewers to see the graph properly before reading the tooltip.\r\nThere is no opague overlap between markets and they are clearly segmented.\r\nNet importers and exporters will be clearly coloured to distinguish between them.\r\n2.2 Improvement to Aesthetic\r\nThere will not be any opague elements that will overlap with other elements so everything will be shown clearly. Other than tooltips which will only appear when hovered over.\r\nOnly 3 colours will be present in the graph to avoid confusing viewers. Black, pink and green.\r\nRemoval of unneeded visuals like icons that do not add to the value of the visual.\r\n3.0 Alternative Graphical Presentation\r\n\r\nPlease view the interactive dashboard on Tableau Public here.\r\nFor a preview of the individual graph, table and tooltips, please refer to 6.0 Appendix.\r\n4.0 Data Visualisation Preparation\r\n4.1 Data Source\r\n4.1.1 Creating the tables\r\nOpen the excel file in Tableau.\r\nCheck “Use Data Interpreter” in Data Source.\r\nUnder data source, drag T1 and T2 into the white space as such and edit their relationship so that Variables = Variables (T2)\r\n\r\n4.1.2 Preparing the table\r\nSelect all the date columns of T1, right click on the column and click Pivot. Repeat for T2.\r\nRight click and delete the following columns:\r\nTable\r\nColumn\r\nT1\r\nVariables - Split 2\r\nT2\r\nVariables (T2) - Split 2\r\nRight click Pivot Field Values in T1 and click Create Calculated Field. Rename the calculated field to Values (Import) and enter the following calculation before clicking OK:\r\n\r\nIF [Variables - Split 1] = ‘European Union’\r\nTHEN [Pivot Field Values]*1000\r\nELSE [Pivot Field Values]\r\nEND\r\n\r\nRight click Pivot Field Values in T2 and click Create Calculated Field. Rename the calculated field to Values (Export) and enter the following calculation before clicking OK:\r\n\r\nIF [Variables (T2) - Split 1] = ‘European Union’\r\nTHEN [Pivot Field Values (Pivot1)]*1000\r\nELSE [Pivot Field Values (Pivot1)]\r\nEND\r\n\r\n\r\nSteps 3 and 4 need to be done as European Union were in Millions while the rest of the markets were in Thousands.\r\n\r\nRight click on the respective columns and rename as follows:\r\nTable\r\nOriginal Name\r\nNew Name\r\nT1\r\nPivot Field Names\r\nDates\r\nT1\r\nVariables - Split 1\r\nMarkets\r\n\r\nThe reason why we do not rename the rest of the columns is because we are not using them during the course of this visualisation.\r\n\r\nClick on the Abc on the Dates column in T1 and click Date. Repeat the same for Pivot Field Names (T2) in T2.\r\n4.1.3 Adding filters\r\nOn the top right of Data Source under Filters, click add.\r\nUnder Edit Data Source Filters, click add…. Select Dates, click OK, select $ Years, click Next, check 2011 to 2020 and press OK. Repeat for Pivot Field Names (Pivot 1) in T2.\r\nUnder Edit Data Source Filters, click add…. Select Markets (Export), click OK, select Malaysia, Mainland China, European Union, United States, Taiwan, Japan, Republic of Korea, Indonesia, Thailand and Hong Kong and press OK. Repeat for Variables (T2) – Split 1 in T2.\r\nBy the end of this step, Edit Data Source Filters should look like this.\r\n\r\n4.2 Interactive Graph\r\n4.2.1 Creating Calculated Fields\r\nClick Sheet 1.\r\nOn the left panel, there is a black triangle. Click the black triangle, click Create Calculated Field and create the following fields:\r\nField Name\r\nFormula\r\nUsage\r\nTotal\r\n[Values (Export)]+[Values (Import)]\r\nDates\r\nT1\r\n([Values (Export)]+[Values (Import)])/2\r\nMarkets\r\nNet\r\n[Values (Export)]-[Values (Import)]\r\nFor other fields\r\nHigh\r\nIF [Values (Export)]>[Values (Import)] THEN [Values (Export)] ELSE [Values (Import)] END\r\nFor graph\r\nLow\r\nIF [Values (Export)]<[Values (Import)] THEN [Values (Export)] ELSE [Values (Import)] END\r\nFor graph\r\nTrade Type\r\nIF SUM([Net])>0 THEN ‘Net Exporter’ ELSE ‘Net Importer’ END\r\nFor colour and tooltip\r\nRatio\r\n[Values (Export)]/[Values (Import)]\r\nFor tooltip\r\nExporter\r\nIF [Trader Type]=‘Net Exporter’ THEN [Trader Type] END\r\nFor tooltip\r\nImporter\r\nIF [Trader Type]=‘Net Importer’ THEN [Trader Type] END\r\nFor tooltip\r\nHigh-Export\r\nIF [Trader Type]=‘Net Exporter’ THEN sum([High]) END\r\nFor tooltip\r\nHigh-Import\r\nIF [Trader Type]=‘Net Importer’ THEN sum([High]) END\r\nFor tooltip\r\nLow-Export\r\nIF [Trader Type]=‘Net Importer’ THEN sum([Low]) END\r\nFor tooltip\r\nLow-Import\r\nIF [Trader Type]=‘Net Exporter’ THEN sum([Low]) END\r\nFor tooltip\r\nExporter-Text\r\nIF [Trader Type]=‘Net Exporter’ THEN ‘exports are higher than imports’ END\r\nFor tooltip\r\nImporter-Text\r\nIF [Trader Type]=‘Net Importer’ THEN ‘imports are higher than exports’ END\r\nFor tooltip\r\nExporter-Net\r\nIF SUM([Net])>0 THEN SUM([Net]) END\r\nFor tooltip\r\nImporter-Net\r\nIF SUM([Net])<0 THEN SUM([Net]) END\r\nFor tooltip\r\nRank\r\nRANK_DENSE(sum([Total]),‘desc’)\r\nFor static table (later)\r\n4.2.2 Creating the Graph\r\nDrag Average to Columns and Markets to Rows. The graph should look like this:\r\n\r\nDrag High and Low to the top of the graph. The graph should look like this:\r\n\r\nUnder Markets, Measure Values, click on the dropdown list that says Automatic and change to Line. The graph should look like this.\r\n\r\nUnder Markets, Measure Values, drag Measure Names, which is currently under Colour, to Path. The graph should look like this:\r\n\r\n4.2.3 Formatting Filters and Colours\r\nDrag Dates into Filters, click Years and click Next. Under Filter [Year of Dates] select Use all instead of Select from list and click OK.\r\nUnder Filters, hover over Year(Dates) and click Show Filter.\r\nOn the right side, Year(Dates) will appear. Hover over it, click the black triangle and click Single Value (List).\r\nUnder Marks, All, drag Trader Type to Colour. The graph should look like this:\r\n\r\nRight click Value on the graph and click Edit Axis. Under General, Axis Title, leave the Title empty. Under Tick Marks, Major Tick Marks, click None. Close the window.\r\nRight click Average on the graph and click Edit Axis. Under Axis Title, rename the Title to Export, Import and Average Values (SGD) and close the window.\r\nHover over AGG(Trader Type), click the black triangle and Edit Colours. Choose the following colours:\r\n\r\nHover over AGG(Trader Type), click on the black triangle and Edit Title. Rename the title to Market Trade Type.\r\n4.2.3 Formatting Title and Tooltips\r\nGo back to Sheet 1.\r\nChange the title to “International Trade with Singapore, ”.\r\nDrag the following to the respective Marks under Tooltips:\r\nFields/Columns\r\nMarks\r\nSUM(Total), AGG(Exporter), AGG(Importer), AVG(Ratio), AGG(High-Export), AGG(High-Import), AGG(Low-Export), AGG(Low-Import), AGG(Exporter-Net), AGG(Importer-Net)\r\nSUM(Average)\r\nAGG(High-Import), AGG(Low-Export), AGG(Low-Import), AGG(Exporter-Net), AGG(Importer-Net), ATTR(Markets), AGG(Importer-Text), AGG(Exporter-Text)\r\nMeasure Values\r\nDrag Total, Net, Values (Import), Values (Export), Ratio, Exporter and Importer to Tooltip, under Marks, All.\r\nHover over SUM(Ratio) under Marks, SUM(Average), click the white triangle, hover over measure and click Average.\r\nClick Tooltip under Marks, SUM(Average) and, before clicking OK, edit the field to the following:\r\n\r\nClick Tooltip under Mark, Measure Values and, before clicking OK, edit the field to the following:\r\n\r\nRight click the respective marks, click Format and format as follows:\r\n\r\nUnder Pane, Default. Click the dropdown list for Numbers, choose Number (Custom), change display units to Billions, and prefix with “SGD “.\r\nThe marks to be formatted with the same step above is as follows:\r\nSUM(Total), SUM(Average), AGG(High-Export), AGG(High-Import), AGG(Low-Export), AGG(Low-Import), AGG(Exporter-Net), AGG(Importer-Net)\r\nMake sure all the tooltips above for both SUM(Average) and Measure Values are formatted accordingly.\r\n\r\n4.2.4 Adding Animation\r\nUnder Format, click Animations.\r\nTurn Workbook Default to On, Duration 0.50 seconds.\r\nDrag Year(Dates) from Filter to Pages.\r\nClick Title and edit as follows:\r\n\r\n4.3 Static Table\r\n4.3.1 Creating Static Table\r\nCreate new sheet and go to Sheet 3.\r\nDrag Year(Dates) into Columns, Markets into Rows, Rank into Text, under Marks, Trader Type into Colour, under Marks and Total into Detail, under Marks.\r\nClick Show Me and make sure it is a table.\r\nHover over Rank, under Marks, click the white triangle, hover over Computer using, click Table (Down).\r\nHover over Markets on the table, click the black triangle, hover over Field, click SUM(Total) and sort the Markets from highest SUM(Total) to lowest.\r\nUnder Marks, click Text and the … Edit the text to font size 12 and bold.\r\nDouble click the title and edit it as follows:\r\n\r\nUnder Marks, click Tooltip and leave the Tooltip blank.\r\nUnder Analytics, click and drag totals to Row Grand Totals.\r\nRight click Grand Total in the table and click format. Under Header, Grand Totals, rename Label to Overall.\r\n4.4 Dashboard\r\n4.4.1 Adding in Interactive Graph\r\nCreate new Dashboard and Drag Sheet 1 into the white space.\r\nHover over filter, click the black triangle and ensure it is Single Value (Dropdown) if it is not yet that.\r\nClick on the Interactive Graph on the Dashboard. On the top, there is a dropdown list that reads Automatic. Click it and choose Entire View.\r\n4.4.2 Adding in Static Table\r\nDrag Sheet 3 below Sheet 1 on the Dashboard\r\nClick on the Static Table on the Dashboard. On the top, there is a dropdown list that reads Automatic. Click it and choose Entire View.\r\n4.4.3 Adding in Text Boxes and Other Formatting\r\nOn the bottom left of the screen, check Show dashboard title and edit the title as follows:\r\n\r\nDrag a Text box below Market Trade Type and edit the text to the following:\r\n\r\nUnder Size, change Dashboard size to 1000x1000 and adjust the heights of the various elements to fit into the Dashboard.\r\n5.0 Derived Insights\r\nExport/Import: Hong Kong has the largest Export/Import ratio with exports being approximately as high as Malaysia (rank 2 in total trade). However, due to low imports, ranking in Total Trade is low.\r\nNet Exporter/Importer: Most countries do not change from Net Exporter to Net Importer or vice versa throughout the years. The only markets that experienced changes were Mainland China, Malaysia and Republic of Korea.\r\nTotal Trade: Unlike the above, markets do change in ranking in terms of total trade with Singapore. The only markets that do not exhibit change are Mainland China and Malaysia with the top 2 ranks and Thailand with the last rank.The markets that exhibit change were EU and US, which changed between ranks 4 and 5, Indonesia, Hong Kong, Taiwan, Japan and Republic of Korea are more volatile and changed between ranks 6 to 9.\r\n6.0 Appendix\r\nInteractive Graph\r\n\r\nStatic Table\r\n\r\nTooltip Graph\r\n\r\nTooltip (For middle circle, Net Exporter)\r\n\r\nTooltip (For middle circle, Net Importer)\r\n\r\nTooltip (For lines, Net Exporter)\r\n\r\nTooltip (For lines, Net Importer)\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-19T03:37:33+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "DataViz 1",
    "description": "DataViz 1 Makeover",
    "author": [
      {
        "name": "Joyce WOON Shi Hui",
        "url": "https://www.linkedin.com/in/joycewoonsh/"
      }
    ],
    "date": "2021-05-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualisation\r\n1.1 Critique of Clarity\r\n1.2 Critique of Aesthetics\r\n\r\n2.0 Suggest Alternative Graphical Presentation\r\n2.1 Improvement to Clarity\r\n2.2 Improvement to Aesthetic\r\n\r\n3.0 Alternative Graphical Presentation\r\n4.0 Data Visualisation Preparation\r\n4.1 Data Source\r\n4.2 Individual Graphs\r\n4.3 Dashboard\r\n\r\n5.0 Derived Insights\r\n6.0 Appendix\r\n6.1 Individual Graphs\r\n6.2 Top Six Trading Companies\r\n\r\n\r\n1.0 Critique of Visualisation\r\nThe original visualisation can be seen below as reference:\r\n\r\n1.1 Critique of Clarity\r\nPros\r\nY-axis starts from 0 which makes it easy to understand.\r\nMatching the graphs with the country it is meant for is very clear due to the country headers.\r\nArea chart was used instead of just dots for time series, making it clearer to understand than if just dots were used.\r\nCons\r\nTitle and Annotations\r\nTitle is ambiguous as it could either be for the six individual countries or an aggregation of the top six trading countries. Also, it did not specify top six trading countries to which country.\r\nThere are no annotations, combined with the ambiguous title, viewers are unsure what the graphs are supposed to explain.\r\nY-axis\r\nUnsure how are imports and exports measured due to lack of information on the Y-axis. The numbers could mean many different things, including volume, costs, etc.\r\nY-axis is confusing due to different intervals used for imports and exports. Due to this, it is not possible to compare import and export volume. For example:\r\nHong Kong’s exports are in intervals of 2M up to 6M and imports are in intervals of 200k up to 800k. At first glance, a viewer might think the difference between exports and imports are not that great, however, this is inaccurate.\r\nJapan has the same intervals for exports and imports but have different interval spacing with imports having less space between intervals. Even with the same intervals, it is not possible to accurately gauge the difference between exports and imports.\r\n\r\nAll the graphs have values above max Y-axis value provided. Due to this, it is not clear to viewers how high the values actually go unless a ruler is used to measure the proportion. The following graphs have this issue:\r\nHong Kong’s exports go over 6M\r\nMainland China’s imports go over 6M\r\nJapan’s exports and imports go over 2M\r\nMalaysia’s exports go above 4M\r\nTaiwan’s exports go above 2M and imports go above 4M\r\nUS’s exports go over 4M\r\n\r\nX-axis\r\nX-axis is confusing as it starts from 2019 to 2021 although the title stated that the graphs are for the period of 2019-2020.\r\nDue to lack of months, it is not possible to gauge which month was in the graphs, or if it was even in chronological order. Thus, it is also not possible to compare between both years as viewers are unsure if the months match between graphs.\r\nJapan’s graph is especially confusing as the X-axis only has 2020. Counting the number of peaks, there are 10 peaks. However, viewers are still unsure whether there really was only 10 months in this graph.\r\n\r\nOthers\r\nFor some parts of the graph, viewers are unable to tell whether the imports are the same or if there is a difference between them. For example:\r\n\r\n1.2 Critique of Aesthetics\r\nPros\r\nComplementary colours (colours on opposite ends of the colour wheel) of orange and blue were used giving a good contrast between exports and imports. The hue and saturation made it softer and easier on the eyes.\r\nNo “junk” like excessive usage of colours, 3D effects, etc.\r\nThe graphs are spaced out and viewers can easily tell which graphs are meant for which country.\r\nCons\r\nColour\r\nAlthough relatively simple natural colours were used, the transparency on the area chart makes the graph complicated and not intuitive for viewers to understand. For example:\r\nThe difference between exports and imports could be either blue or orange.\r\nThe lower volume (either exports or imports) will always be a mixture between both colours.\r\n\r\nSize\r\nThe graph sizes are not equal in terms of width. From longest to shortest, the graphs are as follows: Malaysia, Mainland China, US, Hong Kong, Taiwan and Japan. This makes the visual look messy.\r\nThe entire visual on the website was very small even when viewed from a big screen and even worse when viewed on tablet or phone. Many details were lost and the words are too small. Usually, grey font is alright, however, at this size, the grey font is very difficult to read. Enlarging the image does help, however, there are clarity issues as explained in 1.1 Critique of Clarity, Cons, Others, 1.\r\nOthers\r\nThere are gridlines for exports but no gridlines for imports making it even more difficult to view the graph.\r\nThere is a lot of space underutilised due to the Y-axis starting from 0.\r\n2.0 Suggest Alternative Graphical Presentation\r\nThe plan is to create a dashboard with an aggregation of the Top Six Trading Countries with Singapore followed by the individual graphs. This is based on the assumption that we want to observe how imports and exports have changed between the years and the relationship between imports and exports, i.e. which is higher at any one point. The individual graphs that follow after are for a more detailed dive into what goes into the aggregated graph.\r\nAlso noted that the graph has to be a static graph.\r\nSuggest to have a poster-sized Data Visualisation by utilising the Dashboard as follows:\r\n\r\nThe dashboard will have the following:\r\nOne aggregated line chart\r\nSix line charts for individual countries\r\nDecided to start with a huge line graph which has the aggregated values from all top six trading countries. This is to set the story with the viewer. The goal of this data visualisation is to compare the average trade between the years to see if there are any changes, followed by seeing what caused the change, which could be changes in average export and/or average import. The viewer is then able to dive deeper into the details by looking at the trade data for individual countries.\r\nWe have noted that Top Six Trading Countries with Singapore for 2019-2020 is actually Mainland China, Malysia, US, Taiwan, Hong Kong and Indonesia, however, if we only consider 2020 data, the Top Six Trading Countries is actually the same as the original Data Visualisation. We have decided to keep the original six and put a note in the Data Visualisation on how the Top Six Trading Countries were chosen. Refer to Appendix 6.2 for more information\r\n2.1 Improvement to Clarity\r\nTitle and Subtitles to explain graphs more clearly. Suggest to add an overall aggregated graph for Top Six Trading Countries with Singapore more clearly.\r\nAnnotations are added to periods where difference between exports and imports are unclear.\r\nImports and Exports will be on the same Y-Axis to allow viewers to be able to compare import and export volume.\r\nY-axis values are in SGD.\r\nY-axis marks will always be in intervals of 500k unless it is for the aggregated graph. This is to allow easier comparison between countries. This treatment will not be applied to aggregated graph as this will cause the Y-axis to become overcrowded. Also, it does not really make sense to compare an individual country to the aggregate data as the numbers are very different.\r\nX-axis will now be divided into 2019 and 2020 and further subdivided into the months to make it clear that the months are in chronological order and there was no month missing.\r\nThe min/max values will be marked per pane so viewers do not have to guess if the lines go above the maximum Y-axis marks.\r\nReference lines to denote averages for export, import and trade will be added for easier comparison between the years.\r\n2.2 Improvement to Aesthetic\r\nLine graphs were used instead of area chart to make the graphs simpler than before.\r\nY-axis will not start from 0 to allow better use of the space and make it easier on the eyes to find differences between exports and imports.\r\nThe graph sizes will be standardised.\r\n3.0 Alternative Graphical Presentation\r\n\r\nPlease view the dashboard on Tableau Public here.\r\nRefer to Appendix 6.1 for the Individual Graphs\r\n4.0 Data Visualisation Preparation\r\n4.1 Data Source\r\nOpen the excel file in Tableau.\r\nCheck “Use Data Interpreter” in Data Source.\r\n\r\nDrag T1 into “Drag tables here”.\r\nDrag T2 under T1 to form a union.\r\nCreate “Legend” Group using “Table Name” and renamimng “T1” to “Import” and “T2” to “Export”\r\nSelect and hide unneeded columns. The columns that were hidden are as follows:\r\nDates that do not fall between 2019 Jan and 2020 Dec\r\n“Sheet”\r\n“Table Name”\r\n\r\nSelect all the date columns and pivot.\r\nRename the newly pivoted columns.\r\n“Pivot Field Names” to “Year & Month”.\r\n“Pivot Field Value” to “Values (SGD)”.\r\n“Variables” to \"Countries.\r\n\r\nChange “Year & Month” column format from string to date.\r\nAfter Step 9, the Data Source tab should look like this:  10. Rename “Countries” to “Countries (Original)”. 11. Right click “Countries” and click split. 12. Rename “Countries (Original) - Split 1” to “Countries” 13. Hide both “Countries (Original)”, “Countries (Original) - Split 2” and “Table” 14. Add a Filter with Countries and select “Mainland China”, “Japan”, “Malaysia”, “Taiwan”, “Hong Kong” and “US”.\r\n4.2 Individual Graphs\r\nCreating the Discrete Line Graph\r\nGo to Sheet 1.\r\nDrag Year & Month to Columns twice. Set the first one to “Year” and the other to “Month”.\r\n\r\nMake sure when choosing “Year” and “Month” to choose from the first set (e.g. Month with grey tooltip May instead of May 2015). 3. Drag Values (SGD) to Rows. It will automatically be set to sum.\r\n\r\n\r\nThe recommended graph after this step should be discrete line graph. If it was not set to this, click “Show Me” and change to discrete line graph.\r\n\r\nDrag Legend to Colour under Marks.\r\n\r\nThe colours are already complementary colours blue and orange, which is simple enough and have contrast, thus there is no need to change it.\r\n\r\nClick Colour. Under Effects, Markers, choose the middle option to have dots on the line graph.\r\nDrag Countries to Filter. Right click Countries to show filter and select “Hong Kong”.\r\n\r\nThis step is to ensure that the graph only contains data for the selected country/countries.\r\n\r\nFormatting the X-axis and Y-axis\r\nSelect all the dates in the X-axis, right click and format. Under Header, Default, Dates, choose “First Letter”.\r\n\r\nChose First Letter as it allows the letters to be shows horizontally and read natually instead of vertically.\r\n\r\nClick on the Y-axis and choose Edit Axis. Untick “Include Zero”.\r\n\r\nSome graphs have values way above zero leaving a lot of unused space which could be better utilised.\r\n\r\nRight click on the Y-axis and Format. Under Axis, Numbers, change numbers to “Number (Custom)” with 0 Decimal Places and Display Units as “Thousand (K)”.\r\nCreating Calculated Fields for Future Purpose 1. Create two Calculated Fields “Export” and “Import” as follows:\r\n\r\nIF [Legend]=‘Export’\r\nTHEN [Values (SGD)]\r\nEND\r\n\r\nCreate Calculated Field “Import” as follows:\r\n\r\nIF [Legend]=‘Import’\r\nTHEN [Values (SGD)]\r\nEND\r\n\r\nDrag all the newly created Calculated Fields into Tooltip.\r\nCreating Reference Line (For Individual Countries)\r\nNote: This only has to be done once because when the tab is duplicated, there is no need to change this.\r\nRight click the Y-axis and click on Add Reference Line.\r\nUnder Scope, click “Per Pane”.\r\nUnder Line, ensure Value is “SUM(Export)” and “Average”.\r\nUnder Line, ensure Label is “None”.\r\nUnder Line, ensure Tooltip is “None”.\r\nUnder Formatting, ensure that the line is the 4th option (2nd separated line) and thickness is the 2nd option from the left. Fill Above and Fill Below should be “None”. Colour should be blue (0 down, 6 right).\r\nRight click the reference line created and click Format.\r\nUnder Reference Line Label, Numbers, change number format to Currency (Custom) and ensure there is 0 decimal places, display units are in Thousands (K) and prefix is “SGD”.\r\nRepeat Steps 1 to 8 for Import with the following changes:\r\n\r\nUnder Line, ensure Value is “SUM(Import)” and “Average”\r\nUnder Formatting, ensure that the line is the 4th option (2nd separated line) and thickness is the 2nd option from the left. Fill Above and Fill Below should be “None”. Colour should be orange (0 down, 2 right).\r\n\r\nRepeat Steps 1 to 8 for trade with the following changes:\r\n\r\nUnder Line, ensure Value is “SUM(Values (SGD))” and “Average”\r\nUnder Formatting, ensure that the line is the 2nd option (unbroken line) and thickness is the 2nd option from the left. Fill Above and Fill Below should be “None”. Colour should be default.\r\nThe reason for the line for Average Trade to be different from Export and Import is to clearly show viewers that this is the average for total trade which is derived from export and import and viewers can easily see whether trade has changed between the years without being confused with export and import.\r\n\r\nTooltips\r\nClick on Tooltip and erase everything in the input box.\r\n\r\nThis DataViz is supposed to be static, thus there should not be any Tooltips.\r\n\r\nMark Labels\r\nDrag Values (SGD) into Label.\r\nClick Label, tick “Show mark labels”, under Marks to Label, choose “Min/Max” and under Scope, choose “Pane”.\r\n\r\nThe reason why this is done is because there are some values that go below or above the min or max markers on the Y-axis. This is to let viewers know what are the min/max values the lines can go to instead of relying on guesswork.\r\n\r\nOther Formatting\r\nRename “Sheet 1” tab to “Hong Kong”.\r\nChange title to “Hong Kong”\r\nDuplicating to Create other Line Graphs\r\nDuplicate the “Hong Kong” tab to create sheets for “Mainland China”, “Japan”, “Malaysia”, “Taiwan”, “US” and “(Aggregated) Hong Kong, Mainland China, Japan, Malaysia, Taiwan and US”.\r\nRename Title and Sheet name respectively.\r\nFor each of the above sheets, change the filter to the respective country/ countries.\r\nFor (Aggregated) Hong Kong, Mainland China, Japan, Malaysia, Taiwan and US, delete the reference lines and follow the instructions in the next section.\r\nCreating Reference Line (For Aggregated)\r\nRight click the Y-axis and click on Add Reference Line.\r\nUnder Scope, click “Per Pane”.\r\nUnder Line, ensure Value is “SUM(Export)” and “Average”.\r\nUnder Line, ensure Label is “Custom” and “ = ”\r\nUnder Line, ensure Tooltip is “None”\r\n\r\nThe reason why I chose not to have Tooltip is because the graph for aggregated countries is big and can afford to have the information written in the graph. This is also so that viewers can first have an idea of what the blue and orange reference lines mean before their eyes move on to the smaller individual countries graph.\r\n\r\nUnder Formatting, ensure that the line is the 3th option (separated line below the unseparated line) and thickness is the 2nd option from the left. Fill Above and Fill Below should be “None”. Colour should be blue (0 down, 6 right).\r\nRight click the reference line created and click Format.\r\nUnder Reference Line Label, Font, change font colour to blue (0 down, 6 right).\r\nUnder Reference Line Label, Numbers, change number format to Currency (Custom) and ensure there is 0 decimal places, display units are in Thousands (K) and prefix is “SGD”.\r\nRepeat Steps 1 to 9 for Import with the following changes:\r\n\r\nUnder Line, ensure Value is “SUM(Import)” and “Average”\r\nUnder Formatting, ensure that the line is the 3th option (separated line below the unseparated line) and thickness is the 2nd option from the left. Fill Above and Fill Below should be “None”. Colour should be orange (0 down, 2 right).\r\nUnder Reference Line Label, Font, change font colour to orange (0 down, 2 right).\r\n\r\nRepeat Steps 1 to 9 for trade with the following changes:\r\n\r\nUnder Line, ensure Value is “SUM(Values (SGD))” and “Average”\r\nUnder Formatting, ensure that the line is the 2th option (unbroken line) and thickness is the 2nd option from the left. Fill Above and Fill Below should be “None”. Colour should be default.\r\nThe reason for the line for Average Trade to be different from Export and Import is to clearly show viewers that this is the average for total trade which is derived from export and import and viewers can easily see whether trade has changed between the years without being confused with export and import.\r\n\r\nSpecific-graphs formatting\r\nJapan: Edit Y-axis, change Range to Fixed with Fixed Start at 1,650,000 and Fixed End at 2,650,000.\r\n(Aggregated): Right click empty space in graph and add in annotation for area with “Average exports increased, however, combined with a decrease in average imports, it balanced out and average trade for 2020 only suffer a slight decrease from 2019.”. Format the annotation by changing the shading to None.\r\n4.3 Dashboard\r\nChange size to 1300 x 1620\r\nTick “Show Dashboard Title” and rename to “Merchandise Trade (in SGD) of Top Six Trading Countries*, 2019-2020”. Font is Tableau Book, font size is 18, bold. Height of object is 50.\r\nInsert Text object “*Top Six Trading Countries with Singapore” below. Font is Tableau Book, font size is 10. Height of object is 25.\r\nInsert Horizontal object below, edit height to 400.\r\nInsert Text object “Merchandise Trade (in SGD) of Top Six Trading Countries*, 2019-2020, by Individual Countries”. Font is Tableau Book, font size is 18, bold. Height of object is 50.\r\nInsert Text object “*Top Six Trading Countries with Singapore” below. Font is Tableau Book, font size is 10. Height of object is 25.\r\nInsert Horizontal object below, edit height to 400.\r\nDrag Hong Kong, Mainland China and Japan into the above Horizontal object, side by side. Select and delete all the filters that appear. Select the Horizontal object and distribute contents evenly.\r\nInsert Horizontal object below, edit height to 76.\r\nInsert six Text objects into the Horizontal object. It should be filled up as follows in Tableau Book font, font size 9, bold:\r\n\r\nRepeat the above two steps for the remaining countries. Of course, filling up the averages accordingly to the respective countries.\r\n\r\nIt is important to use the Horizontal Objects so that we can adjust the height and then evenly distribute the content.\r\n\r\n5.0 Derived Insights\r\nWith regards to the aggregated graph, average exports increased, however, average imports decreased. These two movements balanced out leading to a slight decrease in overall trade with Singapore.\r\nTrade with Malaysia fell drastically between 2019 and 2020. The dip around March to May is probably because of Covid-19. Interestingly, Taiwan experienced the same dip but not that drastically. In the end, trade between Singapore and Taiwan recovered much better than Malaysia and there was an increase in overall trade with Taiwan with both exports and imports increasing.\r\nTrade with Mainland China, Hong Kong, Japan and US did not experience a drastic change.\r\n\r\nThere are some interesting observations to be made as follows:\r\nThe increase and decrease in US exports and imports respectively were the biggest change among all individual countries. Even though there was a big change, exports and imports basically switched positions and balanced out, leading to a not very drastic change in overall trade with Singapore.\r\nJapan’s imports decreased while their exports increased. This balanced out, leading to a not very drastic change in overall trade with Singapore.\r\nThere was not much change for imports and exports in Mainland China and Hong Kong with Singapore\r\n\r\n6.0 Appendix\r\n6.1 Individual Graphs\r\n(Aggregated) Hong Kong, Mainland China, Japan, Malaysia, Taiwan and US\r\n\r\nMainland China\r\n\r\nMalaysia\r\n\r\nUS\r\n\r\nTaiwan\r\n\r\nHong Kong\r\n\r\nJapan\r\n\r\n6.2 Top Six Trading Companies\r\n2019-2020: Indonesia, instead of Japan, is in the Top Six \r\n2020: Japan, instead of Indonesia, is in the Top Six \r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T05:28:32+08:00",
    "input_file": {}
  }
]
